{"keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_1", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 32, "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 64, "padding": "valid", "name": "conv2d_2", "kernel_size": [3, 3], "activation": "relu"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 32, "padding": "valid", "name": "conv2d_3", "kernel_size": [3, 3], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "units": 128, "activation": "relu", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "units": 5, "activation": "softmax", "bias_constraint": null}}]}